{
  "home":{
    "greeting": "Bonjour ! Je suis Kévin Taccoen !",
    "occupation": {
      "ai":"Adepte de l'IA",
      "fullstack":"Développeur Full-Stack",
      "student":"Etudiant en Master Informatique"
    },
    "presentationTitle":"Merci pour la visite !",
    "presentationText": "Salut ! Je suis Kévin Taccoen, un étudiant en Master informatique au sein de l'<a href=\"\" target=\"_blank\" rel=\"noopener\">Université du Litoral Côte d'Opale</a>. Je m'intéresse beaucoup aux nouvelles technologies, et leur potentiel de forger l'Avenir.<br>Je fais souvent des expériences avec de l'Intelligence Artificielle, ainsi que de nombreux projets en utilisant mes compétences en développement full-stack, conception de logiciel ou analyse de données.",
    "contactMe": "Une question ? Vous pouvez m'envoyer un message par ici !",
    "contactButton": "Contact",
    "features": {
      "projects":{
        "title": "Toujours occupé sur des projets innovants !",
        "desc": "Que ce soit pour mes études pour sur mon temps libre, je travaille toujours sur de nouveaux projets. J'aime voir comment ces lignes de code peuvent contribuer à améliorer le quotidien, ou faire progresser la Science, et je m'attèle à toujours imaginer, créer et maintenir des choses utiles.",
        "buttonText": "Vers les projets"
      },
      "skills":{
        "title": "Compétences et capacités techniques",
        "desc": "Dans le cadre de mes projets, je dois maîtriser tout un ensemble de technologies, comme la création de sites web, l'analyse de données, l'IA, ou la création de logiciels...",
        "buttonText": "Technologies que j'utilise"
      },
      "education":{
        "title": "Parcours d'apprentissage",
        "desc": "J'apprécie beaucoup découvrir et comprendre de nouvelles choses et concepts. Les différentes formations que j'ai suivies m'ont apportées un savoir précieux dans le cadre de mon travail.",
        "buttonText": "Plus sur mon parcours"
      }
    },
    "projects":{
      "title": "Projets",
      "desc": "Je développe toujours sur quelque chose de nouveau ! Voici une liste de tous les principaux projets sur lesquels j'ai travaillé :",
      "project":{
        "disblock":{
          "title": "Disblock",
          "desc": "Disblock est un projet à la base d'un bot sur Discord. Beaucoup d'utilisateurs veulent personnaliser leur serveur, mais n'ont pas les compétences de codage. Disblock est un moyen de rapidement assembler son propre agent automatisé, en emboîtant des blocs qui décrivent que faire, et quand.",
          "button_text": "Site web du projet",
          "button2_text": "Voir sur GitHub",
          "date": "Depuis 2021"
        },
        "portfolio":{
          "title": "Portfolio Three.js",
          "desc": "Lors de ma troisième année d'informatique, j'ai été chargé de créer un site web présentant tout ce que j'avais réalisé jusqu'ici. J'ai décidé de mobiliser l'ensemble de mes capacités, en créant moi-même les modèles 3D et animations via Blender, tout en utilisant three.js pour les afficher à l'écran. Ce n'est pas à jour de mes dernières activités !",
          "button_text": "Site web du projet",
          "button2_text": "Voir sur GitHub",
          "date": "Depuis novembre 2023"
        },
        "semantic_segmentation":{
          "title": "Segmentation sémantique",
          "desc": "Lors de mon stage à l'Institut National de Technologie de Hachinohe, Japon, il m'a été demandé de faire quelques recherches sur la segmentation sémantique, en utilisant le jeu de données \"Oxford-IIIT Pet Dataset\", et des modèles d'IA comme SegNet, U-Net, et DeepLabV3, ce qui m'a apporté beaucoup de savoir-faire au passage.",
          "button_text": "En savoir plus",
          "date": "D'avril à juillet 2023"
        },
        "video_editor":{
          "title": "Logiciel d'édition vidéo",
          "desc": "J'ai été faire un second stage au Japon, cette fois à l'Institut National de Technologie de Fukushima. J'ai accompagné l'équipe de recherche dans ses travaux sur la perception de la sérialité temporelle à l'œil nu. Mon objectif principal a été de faire un logiciel capable de faire diverses transformations sur des fichiers vidéo.",
          "button_text": "En savoir plus",
          "date": "D'avril à juillet 2024"
        },
        "trading_ai":{
          "title": "Prédiction des cours avec l'Intelligence Artificielle",
          "desc": "Dans le cadre de mon Master, je travaille sur un projet concernant la prédiction des prix futurs des marchés boursiers. Ce projet est toujours en cours, avec des résultats encourageants obtenus pour le moment.",
          "button_text": "En savoir plus",
          "date": "De novembre 2024 à mai 2025"
        }
      },
      "tags":{
        "home": "Projet personnel",
        "school": "Dans le cadre de mes études",
        "research": "Projet de recherche",
        "active": "Développement actif",
        "bugs_only": "Corrections seulement",
        "archived": "Archivé"
      }
    }
  },
  "skills": {
    "title": "Compétences et capacités techniques",
    "subtitle": "A force de travailler sur différents sujets, j'ai appris à me servir de nombreuses technologies. Comme les années et les missions passent, je m'efforce à toujours en découvrir plus et de faire bon usage de mes compétences. Voici quelques exemples de technologies auxquelles j'ai déjà eu affaire :",
    "skills":{
      "ai":{
        "title": "Intelligence Artificielle",
        "desc":"L'IA est un sujet très actif en informatique, et tout en restant informé des dernières découvertes, je passe beaucoup de temps sur des projets IA, en utilisant principalement Tensorflow et des modèles de langage."
      },
      "web":{
        "title": "Développement sites & applications Web",
        "desc": "Les sites et les APIs sont des outils essentiels pour communiquer et partager de l'information entre personnes et services. Maîtriser la création et la maintenance de telles applications est essentiel dans mes travaux."
      },
      "low_level":{
        "title": "Programmation bas niveau",
        "desc": "Certaines applications et algorithmes ont besoin d'être optimisés et rapides. C'est là que les languages comme C, C++ ou Rust sont pratiques. J'écris par moment des programmes conçus pour donner des résultats rapides quand j'étudie des algorithmes."
      },
      "devops":{
        "title": "DevOps et déploiement",
        "desc": "Aussi bien qu'un site ou une application soit développée, si ce n'est pas hébergé et accessible sur Internet, c'est tout de même inutile ! Une bonne compréhension des meilleures pratiques de la mise en ligne est vitale pour créer quelque chose, de la page blanche au serveur de production."
      },
      "data":{
        "title": "Analyse des données",
        "desc": "En travaillant avec des IAs, créer un jeu de données de haute qualité pour l'entraînement est vital. Beaucoup d'opérations et de transformations ont besoin d'être éxécutées, ce qui requiert une solide compréhension de la gestion de données. Certaines infrastructures utilisent aussi des bases de données, contenant de précieuses informations, qui doivent être extraites et analysées pour en tirer le meilleur."
      }
    }
  },
  "education": {
    "title": "Parcours d'apprentissage",
    "subtitle": "Mon parcours d'apprentissage",
    "introduction": "Avant d'atteindre mon niveau actuel, j'ai longtemps appris au sein de diversese institutions qui m'ont acceptées en tant qu'étudiant. Je leur en suis très reconnaissant, car je n'aurai jamais pu découvrir autant sans leur aide.",
    "schools": {
      "middle": {
        "name": "Ensemble Scolaire de La Salle",
        "desc": "Le collège a été là où j'ai découvert mon intérêt pour l'informatique. A ce moment, j'ai un eu professeur de mathématiques très impliqué dans le milieu informatique qui a fait des introductions passionnantes au développement."
      },
      "high": {
        "name": "EPID",
        "desc": "A l'EPID, j'ai eu des cours d'informatique deux fois par semaine, où j'ai appris les bases du développement web, Python, Mysql et quelques algorithmes de base. C'est là que j'ai réellement appris à coder, et à me servir de l'outil informatique."
      },
      "bachelor": {
        "name": "IUT de Calais",
        "desc": "J'ai ensuite rejoint l'IUT de Calais pour un BUT Informatique. J'étais ravis d'en découvrir autant chaque jour, et d'avoir la chance d'aller par deux fois au Japon pour des stages en labo de recherche."
      },
      "master": {
        "name": "ULCO, département Informatique",
        "desc": "La prochaine étape logique, et ma formation actuelle. J'y découvre les grandes lignes de l'Intelligence Artificielle, la gestion et analyse des données, ainsi que l'optimisation d'algorithmes et la résolution de problèmes."
      }
    },
    "diplomas": {
      "junior_high_school": "Brevet des collèges",
      "high_school": "BAC, options Mathématiques expertes et Sciences de l'Informatique",
      "bachelor": "BUT Informatique",
      "master": "Prochainement : Master informatique"
    }
  },
  "contact": {
    "title": "Envoyez-moi un message !",
    "subtitle": "Merci pour votre intérêt ! Le meilleur moyen de me contacter est par e-mail.",
    "emails": {
      "research": {
        "title": "Études & Recherche",
        "desc": "Pour tout ce qui concerne mon parcours académique ou la recherche, merci de passer par {user}<Signe email>{domain}."
      },
      "work": {
        "title": "Pro, entreprises et autres",
        "desc": "Toutes les demandes peuvent aller ici : {user}<Signe email>{domain}"
      }
    }
  },
  "projects":{
    "semantic_segmentation":{
      "title": "Segmentation sémantique",
      "subtitle": "Mon premier stage au Japon, à l'Institut National de technologie d'Hachinohe.",
      "content": {
        "context": {
          "title": "Un peu de contexte sur ce stage...",
          "text": "La photo juste à côté de ce texte est le Kosen d'Hachinohe, l'endroit où j'ai eu la chance d'aller faire mon tout premier stage de recherche. J'y ai été envoyé pour un stage de 3 mois, avec d'autres étudiants Français."
        },
        "semantic": {
          "title": "Étude des modèles de segmentation sémantique",
          "text": "J'ai installé trois modèles sur mon ordinateur, Unet, Segnet et DeeplabV3, puis je les ai entraînés avec le jeu de données \"oxford_iiit_pet\" ( d'où provient l'image du chat de cette page ). J'ai étudié et testé ces modèles puis ai pu en tirer des statistiques et résultats, que j'ai analysés pour en conclure lequel était le meilleur à ce moment.",
          "table": {
            "model": "Modèle",
            "accuracy": "Précision",
            "loss": "Perte",
            "process_time": "Temps de calcul pour une image",
            "year": "Année"
          },
          "result": "Comme le montre ce tableau, le meilleur modèle parmi ceux testés était DeeplabV3. Il a eu le meilleur score de précision, bien qu'il soit un peu plus lent que Unet."
        },
        "human_recognition": {
          "title": "Reconnaissance d'Humains",
          "text": "A côté de la segmentation sémantique, il m'a été demandé de trouver un moyen de détecter un humain depuis un flux vidéo d'une caméra. J'ai choisi le modèle YoloV5 pour implémenter cette fonctionnalité, et j'ai pu obtenir quelques résultats intéréssants."
        }
      }
    },
    "video_editor":{
      "title": "Logiciel d'édition vidéo",
      "subtitle": "Mon deuxième stage au Japon, à l'Institut National de technologie de Fukushima.",
      "fukushima_kosen": {
        "title": "A propos de l'endroit",
        "text": "Pour ce stage, j'ai été accepté au Kosen de Fukushima pour assister l'équipe de recherche locale. J'ai été accompagné par quelques étudiants Français et Finlandais, et hébergé dans le dortoir de l'école pour les 3 mois de mon séjour."
      },
      "perception": {
        "title": "Recherches sur la perception de la sérialité temporelle à l'œil nu",
        "text": "L'une de mes missions a été d'aider l'équipe de recherche à imaginer de nouveaux moyens de créer des séquences pouvant être exploitées dans cette recherche. Les séquences étaient principalement des vidéos de petites billes en chute, ou de cascade.",
        "text2": "Ces expériences étaient filmées avec une caméra classique, et une autre à haute vitesse. Les vidéos créées étaient ensuite passées à un petit programme que j'ai conçu pour travailler sur les frames de ces fichiers."
      },
      "software": {
        "title": "Logiciel d'édition des frames",
        "text": "J'ai créé un logiciel simple permettant aux chercheurs de mofifier rapidement la temporalité des vidéos. Le programme consistait principalement en une interface graphique au-dessus de Ffmpeg, permettant aux utilisateurs de modifier la temporalité en inversant ou réorganisant aléatoirement les images des vidéos, et de réassembler ces frames en un nouveau fichier.",
        "text2": "Voici un exemple d'image extraite de vidéos sur lesquelles nous avons travaillés. Une fois réassemblées de nouveau en fichier vidéo, nous avons pu réaliser quelques expériences sur la perception de la sérialité temporelle."
      },
      "data_recovery": {
        "title": "Récupération de données",
        "text": "Malheureusement, au bout d'un moment, l'ordinateur contenant une partie des données de recherche s'est cassé, et j'ai immédiatement fait tout mon possible pour en récupérer les données perdues. Travaillant sans relâche, j'ai essayé tout un ensemble d'outils de récupération, avant de réaliser que le disque dur était chiffré avec BitLocker, le système de chiffrement de Microsoft. Cette sécurité est activée par défaut sur un grand nombre d'ordinateurs neufs utilisant Windows, et personne dans l'équipe n'en a jamais entendu parler. Sans la clé de secours ( Non sauvegardée dans le compte Microsoft !), les fichiers ont malheureusement été définitivement perdus. C'est pour cette raison que j'ai supprimé Windows de tous mes appareils, et que j'utilise maintenant Linux au quotidien."
      }
    }
  }
}