{
  "home":{
    "greeting": "Hello ! I'm Kévin Taccoen !",
    "occupation": {
      "ai":"AI enthusiast",
      "fullstack":"Full-Stack Developer",
      "student":"Master's degree student"
    },
    "presentationTitle":"Thanks for visiting !",
    "presentationText": "Hi ! I'm Kévin Taccoen, a Computer Science student currently pursuing a Master's degree at <a href=\"https://www.univ-littoral.fr/en/\" target=\"_blank\" rel=\"noopener\">Opal Coast University</a>, France. I'm studying a lot about new technologies, and their potential to shape the Future.<br>Also often playing with Artificial Intelligence, and working on projects using my skills in full-stack development, software conception or data analysis.",
    "contactMe": "Are you looking to send me a message ?",
    "contactButton": "Contact",
    "features": {
      "projects":{
        "title": "Always working on new and innovative things",
        "desc": "Be it for study, work or on my free time, I'm always working on something new. As I love to see how those lines of code can enhance daily life, or make Science moving forward, I strive to always imagine, create and maintain useful things.",
        "buttonText": "See all projects"
      },
      "skills":{
        "title": "Knowledge and Skills",
        "desc": "As part of my projects, I have to master a lot of different fields, like website creation, data analysis, artificial intelligence, or software creation.",
        "buttonText": "More about skills"
      },
      "education":{
        "title": "Education and certifications",
        "desc": "I always enjoys learning and discovering new things and concepts. School gave me a lot of precious knowledge which is often useful in my works.",
        "buttonText": "More about education"
      }
    },
    "projects":{
      "title": "Projects",
      "desc": "I'm always working on something ! Here is a list of all important projects I worked on :",
      "project":{
        "disblock":{
          "title": "Disblock",
          "desc": "Disblock is a project about a Discord bot. A large number of users want to customize their Discord servers with bots, but lacks the coding skills. Disblock is a way to assemble easily his own bot using blocks that can describe what to do, and when.",
          "button_text": "Open the project",
          "button2_text": "See on Github",
          "date": "From 2021 to 2025"
        },
        "portfolio":{
          "title": "Three.js personal website",
          "desc": "As I was a third year student, I was tasked to create a website about everything I had done so far. I decided to use every skill I had to build this project, making myself 3D models and animations using Blender, while three.js is used to render it. Currently, it's not up-to-date !",
          "button_text": "Open the project",
          "button2_text": "See on Github",
          "date": "From November 2023 to July 2025"
        },
        "semantic_segmentation":{
          "title": "Semantic Segmentation",
          "desc": "During my intership at Hachinohe National Institute of Technology, Japan, I was asked to research about Semantic Segmentation using the Oxford-IIIT Pet Dataset, and models like SegNet, U-Net, and DeepLabV3, gaining valuable experience along the way.",
          "button_text": "More about it",
          "date": "From April 2023 to July 2023"
        },
        "video_editor":{
          "title": "Video Editor",
          "desc": "I went for a second internship to Japan, at Fukushima National Institute of Technology. I assisted the Research team with the study on the perception of temporal seriality with the naked eye. My role was to create software able to perform various essentials transformations on videos.",
          "button_text": "More about it",
          "date": "From April 2024 to July 2024"
        },
        "trading_ai":{
          "title": "Prices prediction AI",
          "desc": "As part of my Master's degree studies, I am working on a research project, about stock market price prediction. This project is still ongoing, with encouraging results obtained for now.",
          "button_text": "More about it",
          "date": "From November 2024 to May 2025"
        },
        "this_website":{
          "title": "This website",
          "desc": "A personal website is a must-have when working with Computer Science, so I created one. When people are wondering what I'm working on, or how to send me a message, they can always find here up-to-date information.",
          "button_text": "See on Github",
          "date": "Since February 2025"
        }
      },
      "tags":{
        "home": "Personal project",
        "school": "As part of my studies",
        "research": "Research project",
        "active": "Active",
        "bugs_only": "Bug fixes only",
        "archived": "Archived"
      }
    }
  },
  "skills": {
    "title": "Skills and knowledge",
    "subtitle": "As I have worked on various topics, I learned a lot about different technologies. As years and tasks are going by, I always strive to learn more and make a good use of my capacities. Here are some example of fields I already have dealed with :",
    "skills":{
      "ai":{
        "title": "Artificial Intelligence",
        "desc":"AI is a really hot topic in Computer Science, and while staying updated about the latests discoveries, I spend a lot of time working on AI projects, using mainly Tensorflow and LLMs."
      },
      "web":{
        "title": "Web & Apps development",
        "desc": "Websites and APIs are essentials tools to communicate and share information between people and services. Mastering the ability to create and maintain such applications is essential in my works."
      },
      "low_level":{
        "title": "Low level programming",
        "desc": "Some applications and algorithms need to be highly optimized and run fast. This is where C, C++ or Rust come in handy. I often write programs designed to produce quick results when doing research about algorithms."
      },
      "devops":{
        "title": "DevOps and deployment",
        "desc": "No matter how great is a website or an app, if it's not hosted and accessible on the Internet, it's still useless ! A good understanding of hosting best practices is vital to create something, from the blank file to the production servers."
      },
      "data":{
        "title": "Data analysis",
        "desc": "When working with AI, creating a high-quality dataset for training is vital. Many operations and transformations need to be executed, which require a solid understanding of data management. Some infrasctructures also come with databases containing valuable information, that should be extracted and analysed to extract the best from it."
      }
    }
  },
  "education": {
    "title": "Education and certifications",
    "subtitle": "The steps for my learning journey",
    "introduction": "Before reaching my current level, I had a long time learning various concepts in some nice institutions who accepted me as a student. I'm really grateful towards all of them, as I wouldn't be like I am without their help.",
    "schools": {
      "middle": {
        "name": "Middle school : Ensemble Scolaire de La Salle",
        "desc": "Middle school was were my interest for IT and computers first awaken. Back then, I had a Mathematics teacher deeply involved in the network administration who made really interesting coding introductions."
      },
      "high": {
        "name": "High school : EPID",
        "desc": "At EPID, I had lectures about IT twice a week, where I learnt the bacics of web development, Python, Mysql and some simple algorithms. This is where I really learned how to code and use a computer."
      },
      "bachelor": {
        "name": "Calais IUT",
        "desc": "As I was pretty good with computers, I headed for a Computer Science bachelor at Calais IUT. I was delighted to learn so much about this field everyday, and also got the chance to go twite to Japan for internships in research labs."
      },
      "master": {
        "name": "ULCO University, Computer Science department",
        "desc": "My current formation, and the logic next step. I'm discovering there the basics to Artificial Intelligence, data scientist things and optimizing algorithms and problem solving systems."
      }
    },
    "diplomas": {
      "junior_high_school": "Junior High School Diploma",
      "high_school": "High School Diploma",
      "bachelor": "Bachelor's degree ( Computer Science )",
      "master": "Soon : Master's degree ( Computer Science )"
    }
  },
  "contact": {
    "title": "Send me a message !",
    "subtitle": "Thanks for your interest ! If you want to contact me, the easiest way is by Email.",
    "emails": {
      "research": {
        "title": "About studies or research",
        "desc": "If you want to talk about school or research made as part of my studies, please use {user}<email>{domain}."
      },
      "work": {
        "title": "Work, jobs, others",
        "desc": "All of these can go directly here : {user}<email>{domain}"
      }
    }
  },
  "projects":{
    "semantic_segmentation":{
      "title": "Semantic Segmentation",
      "subtitle": "My first internship in Japan, at Hachinohe National Institute of Technology.",
      "content": {
        "context": {
          "title": "Some context before begining...",
          "text": "The picture you can see next to this text is Hachinohe Kosen, the place where I had the chance to go for my very first research internship. I was sent there for a 3 months stay, with some other French students."
        },
        "semantic": {
          "title": "Semantic Segmentation models study",
          "text": "I installed three models on my laptop, Unet, Segnet and DeeplabV3, and trained them using the \"oxford_iiit_pet\" dataset ( from which the cat picture on this page comes from ). I searched about them and obtained various statistics and results, that I analysed and used to determine which one was the best Semantic Segmentation model back then.",
          "table": {
            "model": "Model",
            "accuracy": "Accuracy",
            "loss": "Loss",
            "process_time": "Processing time for one frame",
            "year": "Release year"
          },
          "result": "According to this table, the best model among those I tested was DeeplabV3. It was the one giving the best results according to Accuracy, but is a little slower than Unet."
        },
        "human_recognition": {
          "title": "Human detection",
          "text": "Alongside with the Semantic Segmentation, I was asked to find a way to recognize an human from a webcam stream. I chose the model YoloV5 to implement this functionality, and got some nice results."
        }
      }
    },
    "video_editor":{
      "title": "Video Editor creation",
      "subtitle": "My second internship in Japan, at Fukushima National Institute of Technology.",
      "fukushima_kosen": {
        "title": "About the place",
        "text": "For this internship, I was accepted at Fukushima Kosen as an help for a research team. I was accompanied by some others French and Finnish students, and hosted in the school dormitory for a 3 months stay."
      },
      "perception": {
        "title": "Research about the perception of temporal seriality with the naked eye",
        "text": "One of my tasks was to help the research team by imaginating new ways to create sequences that can be easily used in this study. Sequences consisted mainly in videos of small balls falling or waterfalls.",
        "text2": "Those experiments are filmed using a normal and a slow motion camera. The resulting files are then passed to a small program I made in order to work on the frames."
      },
      "software": {
        "title": "Frames editing software",
        "text": "I created a simple software that allowed researchers to edit quickly the experiments videos. The program was basically a GUI over ffmpeg, allowing users to alter the temporality by reversing or randomizing frames order, and recreating the edited file.",
        "text2": "Here is an example of a frame coming from some files we worked on. Once assembled into a video file again, we were able to conduct some experiments about the perception of temporal seriality using the naked eye."
      },
      "data_recovery": {
        "title": "Data recovery",
        "text": "Unfortunately, at some point, the laptop containing a part of the research data broke, and I did by best to recover the lost files. Working tirelessly, I tried a lot of different recovery tools, until realizing the hard drive is encrypted using Microsoft's Bitlocker. This security is enabled by default on a large part of new laptops using Windows, and nobody in the team ever heard about it. Without any recovery key (not saved in Microsoft account !), the files were sadly definitively lost. This is the reason why I removed Windows from all my computers, and started using Linux daily."
      }
    }
  },
  "footer": {
    "social": "Social networks",
    "sitemap": "Sitemap",
    "contact": "Contact",
    "contact_button": "Contact",
    "contact_text": "Want to contact me ? Let's have a talk !"
  }
}